Библиотека/src/InformationRegisters/КаталогКниг/КаталогКниг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КаталогКниг</name>
  <resources>
    <name>Наименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>Штрихкод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>13</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Автор</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Издательство</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ISBN</name>
    <comment>Строка в формате с дефисами</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>13</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ISBNЧисло</name>
    <comment>Строка без дефисов для поиска</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>13</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ГодИздания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СсылкаНаСайт</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>СсылкаНаКартинку</name>
    <comment>Ссылка на картинку</comment>
    <type>
      <types>String</types>
    </type>
  </resources>
  <dimensions>
    <name>ИдентификаторКниги</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Библиотека/src/InformationRegisters/КаталогКниг/Forms/ФормаЗаписиКаталогаКниг/Module.bsl
&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ИмяВременногоФайла = ОбщегоНазначенияСервер.ЗагрузитьФайлПоСсылке(Запись.СсылкаНаКартинку);
	
	ФайлНаДиске = Новый Файл(ИмяВременногоФайла);
	Если ФайлНаДиске.Существует() Тогда
		ДвоичныеДанные = Новый ДвоичныеДанные(ИмяВременногоФайла);
		Картинка = ПоместитьВоВременноеХранилище(ДвоичныеДанные, УникальныйИдентификатор);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СсылкаНаСайтНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ПерейтиПоНавигационнойСсылке(Запись.СсылкаНаСайт);
	
КонецПроцедуры

&НаКлиенте
Процедура Импортировать(Команда)
	
	ПараметрыФормы = Новый Структура("ИдентификаторКниги", Запись.ИдентификаторКниги);
	
	ОткрытьФорму("РегистрСведений.КаталогКниг.Форма.ИмпортКниги", ПараметрыФормы, ЭтотОбъект);
	
КонецПроцедуры
